Setup and Imports

In [ ]:
import pandas as pd
import sqlite3

Displaying the first five rows of the orders dataset.

In [2]:
orders = pd.read_csv("orders.csv")

orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

Column names of orders dataset

In [3]:
orders.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name'],
      dtype='object')

Displaying the first five rows of the users dataset.

In [4]:
users = pd.read_json("users.json")

users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

Displaying the first five rows of the restaurants table.

In [6]:
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)

restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

Column Names of restaurant Table

In [7]:
restaurants.columns

Index(['restaurant_id', 'restaurant_name', 'cuisine', 'rating'], dtype='object')

Left Join of orders and users table

In [8]:
merged1 = pd.merge(
    orders,
    users,
    on="user_id",
    how="left"
)

merged1.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

Left join of mergerd1(orders and users) and restaurants

In [9]:
final_df = pd.merge(
    merged1,
    restaurants,
    on="restaurant_id",
    how="left"
)

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

The code exports the `final_df` DataFrame to a CSV file named "final_food_delivery_dataset.csv"

In [10]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

Displays the first five rows of the final_df dataframe

In [11]:
import pandas as pd

final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

Displays the columns of the final_df dataframe

In [12]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

Highest total revenue (total_amount) from Gold members

In [13]:
final_df[final_df['membership']=='Gold'].groupby('city')['total_amount'].sum().idxmax()

'Chennai'

Cuisine that has the highest average order value across all orders

In [14]:
final_df.groupby('cuisine')['total_amount'].mean().idxmax()

'Mexican'

Distinct users placed orders worth more than ₹1000 in total (sum of all their orders)

In [15]:
final_df.groupby('user_id')['total_amount'].sum().gt(1000).sum()

2544

Restaurant rating range that generated the highest total revenue

In [16]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']
final_df['rating_range'] = pd.cut(final_df['rating'], bins=bins, labels=labels, include_lowest=True)
final_df.groupby('rating_range')['total_amount'].sum().idxmax()

C:\Users\dell\AppData\Local\Temp\ipykernel_22684\243525301.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby('rating_range')['total_amount'].sum().idxmax()

'4.6–5.0'

Among Gold members, the city that has the highest average order value

In [17]:
final_df[final_df['membership']=='Gold'].groupby('city')['total_amount'].mean().idxmax()

'Chennai'

Cuisine that has the lowest number of distinct restaurants but still contributes significant revenue

In [18]:
final_df.groupby('cuisine').agg({'restaurant_id':'nunique','total_amount':'sum'}).sort_values(by='restaurant_id')

         restaurant_id  total_amount
cuisine
Chinese            120    1930504.65
Indian             126    1971412.58
Italian            126    2024203.80
Mexican            128    2085503.09

Percentage of total orders that were placed by Gold members (Rounded to nearest integer)

In [34]:
round(len(final_df[final_df['membership']=='Gold']) / len(final_df) * 100)

50

Restaurant that has the highest average order value but less than 20 total orders

In [22]:
specific_restaurants = [
    'Grand Cafe Punjabi',
    'Grand Restaurant South Indian',
    'Ruchi Mess Multicuisine',
    'Ruchi Foods Chinese'
]

restaurant_stats = final_df.groupby('restaurant_name_x').agg(
    avg_order_value=('total_amount', 'mean'),
    order_count=('order_id', 'count')
).reset_index()

filtered_stats = restaurant_stats[restaurant_stats['restaurant_name_x'].isin(specific_restaurants)]

filtered_stats_under_20 = filtered_stats[filtered_stats['order_count'] < 20]

filtered_stats_under_20 = filtered_stats_under_20.sort_values('avg_order_value', ascending=False)

filtered_stats_under_20

       restaurant_name_x  avg_order_value  order_count
254  Ruchi Foods Chinese       686.603158           19

In [23]:
final_df.groupby(['membership','cuisine'])['total_amount'].sum().idxmax()

('Regular', 'Mexican')

Combination that contributes the highest revenue

In [24]:
final_df_filtered = final_df[
    ((final_df['membership']=='Gold') & (final_df['cuisine']=='Indian')) |
    ((final_df['membership']=='Gold') & (final_df['cuisine']=='Italian')) |
    ((final_df['membership']=='Regular') & (final_df['cuisine']=='Indian')) |
    ((final_df['membership']=='Regular') & (final_df['cuisine']=='Chinese'))
]

final_df_filtered.groupby(['membership','cuisine'])['total_amount'].sum().reset_index()

  membership  cuisine  total_amount
0       Gold   Indian     979312.31
1       Gold  Italian    1005779.05
2    Regular  Chinese     952790.91
3    Regular   Indian     992100.27

Quarter of the year that has the total revenue highest

In [25]:
final_df['order_date'] = pd.to_datetime(final_df['order_date'])
final_df['quarter'] = final_df['order_date'].dt.quarter
final_df.groupby('quarter')['total_amount'].sum().idxmax()

C:\Users\dell\AppData\Local\Temp\ipykernel_22684\461650312.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  final_df['order_date'] = pd.to_datetime(final_df['order_date'])

3

Total no. of orders that were placed by users with Gold membership

In [26]:
final_df[final_df['membership']=='Gold'].shape[0]

4987

Total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city

In [27]:
round(final_df[final_df['city']=='Hyderabad']['total_amount'].sum())

1889367

Distinct users that placed at least one order

In [28]:
final_df['user_id'].nunique()

2883

Average order value (rounded to 2 decimals) for Gold members

In [29]:
round(final_df[final_df['membership']=='Gold']['total_amount'].mean(),2)

797.15

Orders that were placed for restaurants with rating ≥ 4.5

In [30]:
final_df[final_df['rating']>=4.5].shape[0]

3374

Orders that were placed in the top revenue city among Gold members only

In [31]:
top_city = final_df[final_df['membership']=='Gold'].groupby('city')['total_amount'].sum().idxmax()
final_df[(final_df['membership']=='Gold') & (final_df['city']==top_city)].shape[0]

1337

Total number of rows in the final merged dataset

In [32]:
final_df.shape[0]

10000